tests/com/l7tech/service/resources/wssInterop2005July_response.xml

<?xml version="1.0" encoding="utf-8" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
  xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
  xmlns:wsse11="http://docs.oasis-open.org/wss/2005/xx/oasis-2005xx-wss-wssecurity-secext-1.1.xsd" >
 <soap:Header>
  <wsse:Security soap:mustUnderstand="1" >
   <wsu:Timestamp wsu:Id="Timestamp" >
    <wsu:Created>2005-05-14T05:55:23.044Z</wsu:Created>
    <wsu:Expires>2005-05-15T05:55:23.044Z</wsu:Expires>
   </wsu:Timestamp>
   <xenc:ReferenceList>
    <xenc:DataReference URI="#EncBody" />
   </xenc:ReferenceList>
   <wsse11:SignatureConfirmation wsu:Id="SigConf"
  Value="fNa57H35Xm/14dDK3wBJ1pkW6i4=" />
   <ds:Signature>
    <ds:SignedInfo>
     <ds:CanonicalizationMethod
  Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
     <ds:SignatureMethod
  Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1" />
     <ds:Reference URI="#Timestamp" >
      <ds:Transforms>
       <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
      </ds:Transforms>
      <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
      <ds:DigestValue>AQ0P8TGCKhgzVci+sc6BEknMyUA=</ds:DigestValue>
     </ds:Reference>
     <ds:Reference URI="#SigConf">
      <ds:Transforms>
       <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
      </ds:Transforms>
      <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
      <ds:DigestValue>0w+mnbSl3pCCLBsEXS9aju0jhbQ=</ds:DigestValue>
     </ds:Reference>
     <ds:Reference URI="#Body">
      <ds:Transforms>
       <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
      </ds:Transforms>
      <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
      <ds:DigestValue>44hQEvD7btVVf7Mz9MrwQ/u/0y4=</ds:DigestValue>
     </ds:Reference>
    </ds:SignedInfo>
    <ds:SignatureValue>eIUZHpNd/Y7ZfKgyHd244RoeqPA=</ds:SignatureValue>
    <ds:KeyInfo>
     <wsse:SecurityTokenReference>
      <wsse:KeyIdentifier
  ValueType="http://docs.oasis-open.org/wss/2005/xx/oasis-2005xx-wss-soap-message-security-1.1#EncryptedKeySHA1" >
SfoOtslHhtkdVlRTrRqCJzXUaeY=
      </wsse:KeyIdentifier>
     </wsse:SecurityTokenReference>
    </ds:KeyInfo>
   </ds:Signature>
  </wsse:Security>
 </soap:Header>
 <soap:Body wsu:Id="Body">
   <xenc:EncryptedData Id="EncBody"
  Type="http://www.w3.org/2001/04/xmlenc#Content" >
    <xenc:EncryptionMethod
  Algorithm="http://www.w3.org/2001/04/xmlenc#aes256-cbc" />
    <ds:KeyInfo>
     <wsse:SecurityTokenReference>
      <wsse:KeyIdentifier
  ValueType="http://docs.oasis-open.org/wss/2005/xx/oasis-2005xx-wss-soap-message-security-1.1#EncryptedKeySHA1" >
SfoOtslHhtkdVlRTrRqCJzXUaeY=
      </wsse:KeyIdentifier>
     </wsse:SecurityTokenReference>
    </ds:KeyInfo>
    <xenc:CipherData>
     <xenc:CipherValue>
OeW+tktu8NV7NLraPtPrBAAXvwPGje2VeWM8QN16coPmY9V2rTJdU5zVohebVOCh6Yh56qZGQkqzv9PWdh1Hx4qLIvcQ+hkb05dPgW19AsaQ4GSAWNcQyQG6Ep+hE85d+N3GHtLUMY9SOoGxZTaTK8BExB6I6KdOrmjtRCFBbVE=
     </xenc:CipherValue>
    </xenc:CipherData>
   </xenc:EncryptedData>
 </soap:Body>
</soap:Envelope>